Revit 2024 API
Document.NewGutter Method
Creates a gutter.
Overload List
Name | Description
NewGutter(GutterType, Reference)
Creates a gutter along a reference.
NewGutter(GutterType, ReferenceArray)
Creates a gutter along a reference array.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace